################################################################################
# Brewfile (https://github.com/Homebrew/homebrew-bundle)
################################################################################

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------

# Core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Public
tap "aws/tap"

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------

# Applications
# NOTE: Comment out the one you may have already installed manually
# Casks
cask "docker"
cask "visual-studio-code"

# ------------------------------------------------------------------------------
# Packages/Formula
# ------------------------------------------------------------------------------

#
# For more information about each package, run:
# `brew info <NAME>`
#

# Libraries (required by other tools below)
brew "expat"
brew "readline"
brew "xz"
brew "zlib"
brew "starship"

# Tools
brew "aws/tap/aws-sam-cli"
brew "awscli@2"
brew "bash"
brew "git-lfs"
brew "git"
brew "jq"
brew "make"
brew "openssl@1.1"
brew "pipx"
brew "vim"

# Language installers
brew "goenv"
brew "jenv"
brew "nodenv"
brew "pyenv"
brew "rbenv"
brew "tfenv"

# Completion
brew "zsh-completions"

################################################################################

